schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    current_timestamp = (double)bigEndian(&packet[69], 4) / 90000;  // seconds

    return id3Size;
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::stopSong() {
    uint32_t pos = 0;
    if(m_f_running) {
        m_f_running = false;
        if(getDatamode() == AUDIO_LOCALFILE) {
            m_streamType = ST_NONE;
            pos = getFilePos() - inBufferFilled();
            audiofile.close();
            AUDIO_INFO("Closing audio file");
        }
    }
    if(audiofile) {
        // added this before putting 'm_f_localfile = false' in stopSong(); shoulf never occur....
        audiofile.close();
        AUDIO_INFO("Closing audio file");
        log_w("Closing audio file");  // for debug
    }
    memset(m_outBuff, 0, 2048 * 2 * sizeof(uint16_t));  // Clear OutputBuffer
    m_validSamples = 0;
    return pos;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::pauseResume() {
    xSemaphoreTake(mutex_audio, portMAX_DELAY);
    bool retVal = false;
    if(getDatamode() == AUDIO_LOCALFILE || m_streamType == ST_WEBSTREAM) {
        m_f_running = !m_f_running;
        retVal = true;
        if(!m_f_running) {
            memset(m_outBuff, 0, 2048 * 2 * sizeof(uint16_t));  // Clear OutputBuffer
            m_validSamples = 0;
        }
    }
    xSemaphoreGive(mutex_audio);
    return retVal;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::playChunk() {

    int16_t sample[2];

    auto pc = [&](int16_t *s16) {  // lambda, inner function
        if(playSample(s16)){
            m_validSamples--;
            m_curSample++;
            return true;
        }
        return false;
    };

    // If we've got data, try and pump it out..
    while(m_validSamples){
        if(getBitsPerSample() == 8) {
            if(getChannels() == 1) {
                uint8_t x = m_outBuff[m_curSample] & 0x00FF;
                uint8_t y = (m_outBuff[m_curSample] & 0xFF00) >> 8;
                sample[RIGHTCHANNEL] = x;
                sample[LEFTCHANNEL] = x;
                if(!pc(sample)){ break;} // playSample in lambda
                sample[RIGHTCHANNEL] = y;
                sample[LEFTCHANNEL] = y;
                if(!pc(sample)){ break;} // playSample in lambda
            }
            if(getChannels() == 2) {
                uint8_t x = m_outBuff[m_curSample] & 0x00FF;
                uint8_t y = (m_outBuff[m_curSample] & 0xFF00) >> 8;
                if(!m_f_forceMono) {  // stereo mode
                    sample[RIGHTCHANNEL] = x;
                    sample[LEFTCHANNEL] = y;
                }
                else {  // force mono
                    uint8_t xy = (x + y) / 2;
                    sample[RIGHTCHANNEL] = xy;
                    sample[LEFTCHANNEL] = xy;
                }
                if(!pc(sample)){ break;} // playSample in lambda
            }
        }

        if(getBitsPerSample() == 16) {
            if(getChannels() == 1) {
                sample[RIGHTCHANNEL] = m_outBuff[m_curSample];
                sample[LEFTCHANNEL] = m_outBuff[m_curSample];
            }
            if(getChannels() == 2) {
                    if(!m_f_forceMono) {  // stereo mode
                        sample[RIGHTCHANNEL] = m_outBuff[m_curSample * 2];
                        sample[LEFTCHANNEL] = m_outBuff[m_curSample * 2 + 1];
                    }
                    else {  // mono mode, #100
                        int16_t xy = (m_outBuff[m_curSample * 2] + m_outBuff[m_curSample * 2 + 1]) / 2;
                        sample[RIGHTCHANNEL] = xy;
                        sample[LEFTCHANNEL] = xy;
                    }
            }
        }
        if(!pc(sample)){ break;} // playSample in lambda
    }
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::loop() {
    if(!m_f_running) return;

    xSemaphoreTake(mutex_audio, portMAX_DELAY);

    if(m_playlistFormat != FORMAT_M3U8) { // normal process
        switch(getDatamode()) {
        case AUDIO_LOCALFILE: processLocalFile(); break;
        case HTTP_RESPONSE_HEADER: parseHttpResponseHeader(); break;
        case AUDIO_PLAYLISTINIT: readPlayListData(); break;
        case AUDIO_PLAYLISTDATA:
            if(m_playlistFormat == FORMAT_M3U) connecttohost(parsePlaylist_M3U());
            if(m_playlistFormat == FORMAT_PLS) connecttohost(parsePlaylist_PLS());
            if(m_playlistFormat == FORMAT_ASX) connecttohost(parsePlaylist_ASX());
            break;
        case AUDIO_DATA:
            if(m_streamType == ST_WEBSTREAM) processWebStream();
            if(m_streamType == ST_WEBFILE) processWebFile();
            break;
        }
    }
    else { // m3u8 datastream only
        const char* host;

        switch(getDatamode()) {
        case HTTP_RESPONSE_HEADER:
            if(!parseHttpResponseHeader()){
                if(m_f_timeout) connecttohost(m_lastHost);
            }
            m_codec = CODEC_AAC;
            break;
        case AUDIO_PLAYLISTINIT:
            readPlayListData();
            break;
        case AUDIO_PLAYLISTDATA:
            host = parsePlaylist_M3U8();
            if(host) { // host contains the next playlist URL
                httpPrint(host);
            }
            else { // host == NULL means connect to m3u8 URL
                httpPrint(m_lastM3U8host);
                setDatamode(HTTP_RESPONSE_HEADER); // we have a new playlist now
            }

            break;
        case AUDIO_DATA:
            if(m_f_ts) { processWebStreamTS(); } // aac or aacp with ts packets
            else { processWebStreamHLS(); }      // aac or aacp normal stream

            if(m_f_continue) { // at this point m_f_continue is true, means processWebStream() needs more data
                setDatamode(AUDIO_PLAYLISTDATA);
                m_f_continue = false;
            }
            break;
        }
    }
    xSemaphoreGive(mutex_audio);
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::readPlayListData() {
    if(getDatamode() != AUDIO_PLAYLISTINIT) return false;
    if(_client->available() == 0) return false;

