schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    if(m_playlistURL.size() > 0) {
        if(m_playlistBuff) {free(m_playlistBuff); m_playlistBuff = NULL;}

        if(m_playlistURL[m_playlistURL.size() - 1]) {
            m_playlistBuff = strdup(m_playlistURL[m_playlistURL.size() - 1]);
            free(m_playlistURL[m_playlistURL.size() - 1]);
            m_playlistURL[m_playlistURL.size() - 1] = NULL;
            m_playlistURL.pop_back();
            m_playlistURL.shrink_to_fit();
        }
        if(m_f_Log) log_i("now playing %s", m_playlistBuff);
        if(endsWith(m_playlistBuff, "ts")) m_f_ts = true;
        if(indexOf(m_playlistBuff, ".ts?") > 0) m_f_ts = true;
        return m_playlistBuff;
    }
    else {
        if(f_EXTINF_found){
            if(f_mediaSeq_found){
                if(m_playlistContent.size() == 0) return NULL;
                uint64_t mediaSeq = m3u8_findMediaSeqInURL();
                if(xMedSeq == 0 || xMedSeq == UINT64_MAX) {log_e("xMediaSequence not found"); connecttohost(m_lastHost);}
                if(mediaSeq < xMedSeq){
                    uint64_t diff = xMedSeq - mediaSeq;
                    if(diff < 10) {;}
                    else {
                        if(m_playlistContent.size() > 0){
                            for(int j = 0; j < lines; j++){
                                if(m_f_Log) log_i("lines %i, %s",lines, m_playlistContent[j]);
                            }
                        }
                        else{;}

                        if(m_playlistURL.size() > 0){
                            for(int j = 0; j < m_playlistURL.size(); j++){
                                if(m_f_Log) log_i("m_playlistURL lines %i, %s",j, m_playlistURL[j]);
                            }
                        }
                        else{;}

                        if(m_playlistURL.size() == 0) {connecttohost(m_lastHost);}
                    }
                }
                else{
                    if(mediaSeq != UINT64_MAX){
                        log_e("err, %u packets lost from %u, to %u", mediaSeq - xMedSeq, xMedSeq, mediaSeq);
                    }
                    xMedSeq = mediaSeq;
                }
            } // f_medSeq_found
        }
    }
    return NULL;
}
//---------------------------------------------------------------------------------------------------------------------
const char* Audio::m3u8redirection(){
    // example: redirection
    // #EXTM3U
    // #EXT-X-STREAM-INF:BANDWIDTH=117500,AVERAGE-BANDWIDTH=117000,CODECS="mp4a.40.2"
    // 112/playlist.m3u8?hlssid=7562d0e101b84aeea0fa35f8b963a174
    // #EXT-X-STREAM-INF:BANDWIDTH=69500,AVERAGE-BANDWIDTH=69000,CODECS="mp4a.40.5"
    // 64/playlist.m3u8?hlssid=7562d0e101b84aeea0fa35f8b963a174
    // #EXT-X-STREAM-INF:BANDWIDTH=37500,AVERAGE-BANDWIDTH=37000,CODECS="mp4a.40.29"
    // 32/playlist.m3u8?hlssid=7562d0e101b84aeea0fa35f8b963a174

    uint32_t bw[20] = {0};
    uint32_t finalBW = 0;
    uint16_t choosenLine = 0;
    uint16_t plcSize = m_playlistContent.size();
    if(plcSize > 20) plcSize = 20;
    int16_t posBW = 0;

    for(uint16_t i = 0; i < plcSize; i++){   // looking for best (highest) bandwidth
        posBW = indexOf(m_playlistContent[i], "BANDWIDTH=");
        if(posBW > 0){
            char* endP;
            bw[i] = strtol(m_playlistContent[i] + posBW + 10, &endP, 10); // read until comma
        }
    }
    for(uint16_t i = 0; i < plcSize; i++){
        if(bw[i] > finalBW) {finalBW = bw[i], choosenLine = i + 1;}
    }
    AUDIO_INFO("bandwidth: %lu bit/s", (long unsigned)finalBW);

    char* tmp = nullptr;
    if((!endsWith(m_playlistContent[choosenLine], "m3u8") && indexOf(m_playlistContent[choosenLine], "m3u8?") == -1)) {
        // we have a new m3u8 playlist, skip to next line
        int pos = indexOf(m_playlistContent[choosenLine - 1], "CODECS=\"mp4a", 18);
        // 'mp4a.40.01' AAC Main
        // 'mp4a.40.02' AAC LC (Low Complexity)
        // 'mp4a.40.03' AAC SSR (Scalable Sampling Rate) ??
        // 'mp4a.40.03' AAC LTP (Long Term Prediction) ??
        // 'mp4a.40.03' SBR (Spectral Band Replication)
        if(pos < 0) {  // not found
            int pos1 = indexOf(m_playlistContent[choosenLine - 1], "CODECS=", 18);
            if(pos1 < 0) pos1 = 0;
            log_e("codec %s in m3u8 playlist not supported", m_playlistContent[choosenLine - 1] + pos1);
            goto exit;
        }
    }
    if(!startsWith(m_playlistContent[choosenLine], "http")) {

        // http://livees.com/prog_index.m3u8 and prog_index48347.aac -->
        // http://livees.com/prog_index48347.aac http://livees.com/prog_index.m3u8 and chunklist022.m3u8 -->
        // http://livees.com/chunklist022.m3u8


        tmp = (char*)malloc(strlen(m_lastHost) + strlen(m_playlistContent[choosenLine]));
        strcpy(tmp, m_lastHost);
        int idx1 = lastIndexOf(tmp, "/");
        strcpy(tmp + idx1 + 1, m_playlistContent[choosenLine]);
    }
    else { tmp = strdup(m_playlistContent[choosenLine]); }

    if(m_playlistContent[choosenLine]) {
        free(m_playlistContent[choosenLine]);
        m_playlistContent[choosenLine] = NULL;
    }
    m_playlistContent[choosenLine] = strdup(tmp);
    if(m_lastM3U8host){free(m_lastM3U8host); m_lastM3U8host = NULL;}
    m_lastM3U8host = strdup(tmp);
    if(tmp) {
        free(tmp);
        tmp = NULL;
    }
    if(m_f_Log) log_i("redirect to %s", m_playlistContent[choosenLine]);
    _client->stop();
    return m_playlistContent[choosenLine];  // it's a redirection, a new m3u8 playlist
exit:
    stopSong();
    return NULL;
}
//---------------------------------------------------------------------------------------------------------------------
uint64_t Audio::m3u8_findMediaSeqInURL(){ // We have no clue what the media sequence is

    char* pEnd;
    uint64_t MediaSeq = 0;
    uint8_t  idx = 0;
    uint16_t linesWithURL[3] = {0};
    char llasc[21]; // uint64_t max = 18,446,744,073,709,551,615  thats 20 chars + \0

    for(uint16_t i = 0; i < m_playlistContent.size(); i++){
        if(startsWith(m_playlistContent[i], "#EXTINF:")) {
            linesWithURL[idx] = i + 1;
            idx++;
            if(idx == 3) break;
        }
    }
    if(idx < 3){
        log_e("not enough lines with \"#EXTINF:\" found");
        return UINT64_MAX;
    }

