schreibfaul1/ESP32-audioI2S/src/Audio.cpp
    p1 = audiofile.read();
    p2 = audiofile.read();
    pos+=2;
    while(!found || pos == m_file_size){
        if(p1 == 0xFF && p2 == 0xF8){found = true; break;}
        p1 = p2;
        p2 = audiofile.read();
        pos++;
    }

    if(found) return (pos - 2);
    return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::mp3_correctResumeFilePos(uint32_t resumeFilePos) {
    // The starting point is the next MP3 syncword
    uint8_t  p1, p2;
    boolean  found = false;
    uint32_t pos = resumeFilePos;
    audiofile.seek(pos);

    p1 = audiofile.read();
    p2 = audiofile.read();
    pos += 2;
    while(!found || pos == m_file_size) {
        if(p1 == 0xFF && (p2 & 0xF0) == 0xF0) {
            found = true;
            break;
        }
        p1 = p2;
        p2 = audiofile.read();
        pos++;
    }
    MP3Decoder_ClearBuffer();
    if(found) return (pos - 2);
    return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
uint8_t Audio::determineOggCodec(uint8_t* data, uint16_t len) {
    // if we have contentType == application/ogg; codec cn be OPUS, FLAC or VORBIS
    // let's have a look, what it is
    int idx = specialIndexOf(data, "OggS", 6);
    if(idx != 0) {
        if(specialIndexOf(data, "fLaC", 6)) return CODEC_FLAC;
        return CODEC_NONE;
    }
    data += 27;
    idx = specialIndexOf(data, "OpusHead", 40);
    if(idx >= 0) return CODEC_OPUS;
    idx = specialIndexOf(data, "fLaC", 40);
    if(idx >= 0) return CODEC_FLAC;
    idx = specialIndexOf(data, "vorbis", 40);
    if(idx >= 0) {
        log_i("vorbis");
        return CODEC_VORBIS;
    }
    return CODEC_NONE;
}
//----------------------------------------------------------------------------------------------------------------------
